In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Generate sample data
pd.set_option('display.max_columns', None)

#Loading the dataset
df = pd.read_csv(r"D:\Intern_ship_projs\ecommerce_5000_rows_with_names_v2.csv")

print('Shape of the dataset:', df.shape)
df.head()

Shape of the dataset: (5000, 14)

,Order_ID,Customer_ID,Customer_Name,Category,Price,Quantity,Discount_%,Device_Type,Payment_Method,City,Session_Duration_Min,Rating,Delivered_On_Time,Total_Amount
0,1,8270,Avery Smith,Beauty,9860.04,4,40.11,Tablet,Debit Card,Pune,2.27,3,Yes,23620.71
1,2,1860,Casey Brown,Sports,5228.14,3,26.47,Mobile,Cash on Delivery,Kolkata,40.70,5,Yes,11532.75
2,3,6390,Avery Lee,Beauty,17710.04,3,34.22,Mobile,Net Banking,Bengaluru,36.90,4,Yes,34948.99
3,4,6191,Morgan Miller,Sports,11582.71,4,31.14,Mobile,Net Banking,Pune,39.15,3,No,31903.42
4,5,6734,Avery Clark,Beauty,4500.84,2,7.64,Desktop,Cash on Delivery,Hyderabad,13.88,4,Yes,8313.95

In [3]:
print('\nMissing values in each column:')
print(df.isnull().sum())

Missing values in each column:
Order_ID                0
Customer_ID             0
Customer_Name           0
Category                0
Price                   0
Quantity                0
Discount_%              0
Device_Type             0
Payment_Method          0
City                    0
Session_Duration_Min    0
Rating                  0
Delivered_On_Time       0
Total_Amount            0
dtype: int64